# Target Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TessellatedShapeBuilder..::..Target Property
TessellatedShapeBuilder Class See Also
---
Requests the type of geometry to be built.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public TessellatedShapeBuilderTarget Target { get; set; }
```

Visual Basic
---
```text
Public Property Target As TessellatedShapeBuilderTarget
	Get
	Set
```

Visual C++
---
```text
public:
property TessellatedShapeBuilderTarget Target {
	TessellatedShapeBuilderTarget get ();
	void set (TessellatedShapeBuilderTarget value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace